#### ExportLayerInfo Members

---

|  |
| --- |
| ExportLayerInfo Class   Constructors   Methods   Properties   See Also |

The  ExportLayerInfo  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ExportLayerInfo | Constructs a new ExportLayerInfo with default values. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | AddCutLayerModifier | Adds a cut layer modifier to the layer info. |
| Public method | AddLayerModifier | Adds a project layer modifier to the layer info. |
| Public method | ClearCutLayerModifiers | Clears all the cut layer modifiers stored in the layer info. |
| Public method | ClearLayerModifiers | Clears all the project layer modifiers stored in the layer info. |
| Public method | Dispose | Releases all resources used by the  ExportLayerInfo |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetCutLayerModifiers | Gets all the cut layer modifiers from the layer info. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetLayerModifiers | Gets all the project layer modifiers from the layer info. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | RemoveCutLayerModifier | Removes a cut layer modifier from the layer info. |
| Public method | RemoveLayerModifier | Removes a project layer modifier from the layer info. |
| Public method | SetCutLayerModifiers | Sets a cut layer modifier array to the layer info. |
| Public method | SetLayerModifiers | Sets a project layer modifier array to the layer info. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | CategoryType | The category type which this layer belongs to. |
| Public property | ColorName | The color name stored in value. For IFC export, the naming is to match the "colornumber" setting -- really, this stores a string that generates the colorNumber (for formats that don't use the color but need a second entry.) |
| Public property | ColorNumber | The color number stored in value. |
| Public property | CutColorNumber | The cut color number stored in value. |
| Public property | CutLayerName | The cut layer name stored in value. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | LayerName | The layer name stored in value. |

# See Also

ExportLayerInfo Class

Autodesk.Revit.DB Namespace